[
    {
        "title": "Automated Frameworks of Semantic Augmentation to Improve Mathematical Word Problem Solving",
        "start": "April 2024",
        "end": "June 2024",
        "description": "Developed a framework leveraging digit-level semantics to improve language model performance in solving mathematical word problems (MWPs) by incorporating context-aware prompt generation techniques.\nUtilized BLEU scores and Levenshtein distance in a demonstration selection algorithm and a prompt selection model to identify the most similar equations for one-shot examples, optimizing prompt accuracy.\nFine-tuned TinyLlama and prompted PaLM2 with prompt-enhanced GSM8K questions, resulting in improved accuracy on the SVAMP dataset and uncovering insights into the varying context requirements of different mathematical operations.\nCompleted as part of ECS 271 : Machine Learning & Discovery at UC Davis.",
        "skills": [
            "NLP",
            "Prompting",
            "Machine Learning"
        ],
        "links": {
            "Paper": "/assets/papers/prompting.pdf"
        },
        "image": "/images/prompting.png"
    },
    {
        "title": "The Effects of Toxicity on Disengagement in Open Source Projects",
        "start": "January 2024",
        "end": "March 2024",
        "description": "Analyzed factors contributing to developer disengagement in open-source projects, focusing on the impact of toxic communications on contributor retention and project sustainability.\nUtilized sentiment analysis to quantify toxicity within open-source communities and examined its correlation with developer engagement across various programming communities and corporate/non-profit projects.\nProposed community-driven policies and practical implications for project maintainers, aiming to mitigate negative interactions and enhance collaborative practices in open-source environments. \nCompleted as part of ECS 260 : Software Engineering at UC Davis.",
        "skills": [
            "Open Source",
            "GitHub Mining",
            "Data Analysis"
        ],
        "links": {
            "Paper": "/assets/papers/toxicity.pdf"
        },
        "image": "/images/toxicity.png"
    },
    {
        "title": "What is the behavior of Spectre, a speculative prediction exploit, on the various branch predictors available in the computer architecture simulator gem5?",
        "start": "October 2023",
        "end": "December 2023",
        "description": "Investigated susceptibility of x86-based in-order and out-of-order processors to Spectre V1 attacks using gem5 v23.0, revealing correlations between Spectre effectiveness and branch predictor characteristics.\nSuggested features for a Spectre-resistant branch predictor, emphasizing extended training periods and mitigation of biased branches to improve processor security against speculative execution attacks.\nHighlighted the importance of understanding speculative execution and branch prediction in enhancing processor security, contributing to the development of more secure computing systems.\nCompleted as part of ECS 235A : Computer & Info Security at UC Davis.",
        "skills": [
            "gem5",
            "Spectre",
            "Computer Security"
        ],
        "links": {
            "Paper": "/assets/papers/spectre.pdf"
        },
        "image": "/images/spectre.png"
    },
    {
        "title": "gem5 Vision",
        "start": "January 2023",
        "end": "June 2023",
        "description": "Implemented advanced search functionality to enhance resource discovery within the gem5 ecosystem.\nIntroduced semantic versioning and built upon a comprehensive resource categorization system for easy access to newer resource versions under specific categories.\nExpanded gem5's database support by integrating local and remote JSON files and MongoDB, improving efficiency and user accessibility.",
        "skills": [
            "NextJS",
            "MongoDB",
            "Python",
            "JSON Schema"
        ],
        "links": {
            "Poster": "https://www.gem5.org/assets/files/workshop-isca-2023/posters/gem5-vision-poster.pdf"
        },
        "image": "/images/gem5vision.png"
    },
    {
        "title": "QuixFolio",
        "start": "March 2023",
        "end": "April 2023",
        "description": "Demonstrated strong coding and programming skills to create QuixFolio as an open-source project.\nStreamlined the portfolio creation process by providing a wide range of customizable templates and easy information input options.\nImplemented hosting capabilities on GitHub pages, enabling seamless portfolio sharing and accessibility.\nSuccessfully launched the alpha version of QuixFolio, which garnered significant traction with over 190 visitors and 1000+ page views within the first week.",
        "skills": [
            "ReactJS",
            "NextJS",
            "Material UI",
            "GitHub Pages",
            "GitHub Actions"
        ],
        "links": {
            "Website": "https://quixfolio.vercel.app/"
        },
        "image": "/images/quixfolio.webp"
    },
    {
        "title": "OLED Paint",
        "start": "May 2022",
        "end": "May 2022",
        "description": "Utilized SPI and I2C to create a tilt-based paint application between the CC3200 and Adafruit OLED.\nCreated a webserver and implemented a compression algorithm to transfer 128x128 bitmaps from a board to a computer.\nConferred Best Lab Project for Spring 2022.\nSolidified skills of utilizing datasheet information to interact with hardware better.",
        "skills": [
            "C",
            "Python"
        ],
        "links": {
            "Blog Post": "/blogs/oledpaint"
        },
        "image": "/images/oledpaint.jpeg"
    },
    {
        "title": "UNIfy - Course Assistant",
        "start": "January 2022",
        "end": "January 2022",
        "description": "Utilized the UC Davis Schedule Builder API to extract class timings and professors.\nFormulated a class-based hierarchized dictionary to maintain schedules of over 100 server members in five Discord servers.\nExtracted data from APIs of Rate My Professor and Google Calendar to add additional features to the bot.\nSolidified skills of good software design to understand and solve problem domain.",
        "skills": [
            "Discord Bot",
            "Python",
            "JavaScript"
        ],
        "image": "/images/unify.png",
        "links": {
            "Blog Post": "/blogs/unifycourseassistant"
        }
    }
]