[
    {
        "title": "Improving Few-Shot Prompts with Relevant Static Analysis Products",
        "authors": [
            "Toufique Ahmed",
            "Kunal Suresh Pai",
            "Premkumar Devanbu",
            "Earl T. Barr"
        ],
        "type": "preprint",
        "description": "Adding explicit semantic facts as prompts to Large Language Models improves their performance in code summarization tasks, with notable improvements exceeding 2 BLEU and, in some cases, even surpassing 30 BLEU, demonstrating the effectiveness of this approach in enhancing code analysis and extraction of essential information.",
        "tags": [
            "Software Engineering",
            "Machine Learning",
            "Naturalness of Software"
        ],
        "link": "https://arxiv.org/pdf/2304.06815"
    },
    {
        "title": "Validating Hardware and SimPoints with gem5: A RISC-V Board Case Study",
        "authors": [
            "Kunal Pai",
            "Zhantong Qiu",
            "Jason Lowe-Power"
        ],
        "type": "poster",
        "description": "The poster discusses the development of a RISC-V board model (RISCVMatched) in gem5, along with a methodology for fine-tuning gem5 configurations to closely match real-life systems, resulting in more accurate hardware validation and simulation capabilities.",
        "conference": "ISCA 2023: gem5 Workshop",
        "tags": [
            "Computer Architecture",
            "gem5"
        ],
        "link": "https://www.gem5.org/assets/files/workshop-isca-2023/posters/validating-hardware-and-simpoints-with-gem5-poster.pdf"
    },
    {
        "title": "gem5 Vision",
        "authors": [
            "Parth Shah",
            "Kunal Pai",
            "Harshil Patel",
            "Arslan Ali"
        ],
        "type": "poster",
        "description": "The gem5 Vision Project seeks to improve user-friendliness and accessibility by introducing advanced search functionality, comprehensive resource categorization, and expanded database support within the gem5 ecosystem for researchers and developers.",
        "conference": "ISCA 2023: gem5 Workshop",
        "tags": [
            "Computer Architecture",
            "gem5"
        ],
        "link": "https://www.gem5.org/assets/files/workshop-isca-2023/posters/gem5-vision-poster.pdf"
    },
    {
        "title": "What is the behavior of Spectre, a speculative prediction exploit, on the various branch predictors available in the computer architecture simulator gem5?",
        "authors": [
            "Kunal Pai",
            "Yuyi Li",
            "Frank Gomez"
        ],
        "type": "project",
        "conference": "ECS235A: Computer Security (UC Davis)",
        "description": "This project investigates Spectre attacks on x86-based processors, focusing on in-order and out-of-order processors' susceptibility to speculative execution vulnerabilities using gem5 v23.0 and Spectre V1. Out-of-order processors exhibit vulnerability, with findings revealing correlations between Spectre effectiveness and branch predictor characteristics. The study proposes features for a Spectre-resistant branch predictor, emphasizing the importance of extended training periods and mitigating biased branches to enhance processor security against speculative execution attacks. It was done as part of the Computer Security course at UC Davis.",
        "tags": [
            "Computer Architecture",
            "Computer Security",
            "gem5"
        ],
        "link": "/assets/papers/spectre.pdf"
    }
]