[
    {
        "title": "Graduate Student Researcher",
        "organization": "DArchR Lab @ University of California, Davis",
        "start": "June 2023",
        "end": "Present",
        "description": "Leading a team to develop a superconductor-based graph accelerator in the gem5 simulator.\nLeading a team to deliver full-system, cycle-level simulation models for cryogenic semiconductors and superconductors in gem5.\nCollaborating with a team to develop an autotuning methodology with 90% correlation between gem5 simulation results and hardware profiling metrics.\nMentoring 5 undergraduate students in the Davis Computer Architecture Lab to prepare them for graduate research.",
        "location": "Davis, CA",
        "image": "/images/darchr.png"
    },
    {
        "title": "Student Researcher",
        "organization": "University of California, Davis",
        "start": "September 2022",
        "end": "December 2024",
        "description": "Developed a dataset for pairwise code-documentation alignment from open-source Python projects, to assist with future tasks in software maintenance.\nCreated a pipeline for measuring calibration and correctness of large language models for code repair, using Defects4J.\nAssisted in validating the efficacy of semantic augmentation of language model prompts for code summarization using precision and recall metrics like ROUGE and METEOR.",
        "location": "Davis, CA",
        "image": "/images/ucdavis.png"
    },
    {
        "title": "Teaching Assistant",
        "organization": "University of California, Davis",
        "start": "September 2023",
        "end": "December 2023",
        "description": "Assisted 180 students in a senior-level Probability & Statistical Modeling class.",
        "location": "Davis, CA",
        "image": "/images/ucdavis.png"
    },
    {
        "title": "Undergraduate Researcher",
        "organization": "DArchR Lab @ University of California, Davis",
        "start": "June 2022",
        "end": "June 2023",
        "description": "Implemented a model of the HiFive Unmatched RISC-V board in gem5, achieving 85% accuracy with hardware profiling metrics.\nAuthored a poster on the validation of hardware and simpoints with gem5, presented at the gem5 workshop at ISCA 2023.\nCo-authored tutorials on perf compilation for RISC-V and documentation for the Standard Library in gem5.",
        "location": "Davis, CA",
        "image": "/images/darchr.png"
    },
    {
        "title": "Tech Team Lead",
        "organization": "humanID",
        "start": "January 2022",
        "end": "June 2022",
        "description": "Delivered 10 completed projects with global teams, including: \nDocumentation of a Discord bot that combats spam and fake users\n A Django-based web application for permission management for 100 users.",
        "location": "Davis, CA",
        "image": "/images/humanid.webp"
    },
    {
        "title": "Technical Product Marketing Intern",
        "organization": "SiTime Corp.",
        "start": "July 2021",
        "end": "September 2021",
        "description": "Presented strategy to improve distributor margins, identified up to $250K in potential upside.\nConducted a market survey on optical transceivers used in AI networking, to identify customers for MEMS timing chips.\n Created Visio diagrams for the product requirements document (PRD) of a timing chip.",
        "location": "Santa Clara, CA",
        "image": "/images/sitime.png"
    }
]
